#Используем Gradle 8.11.1 и JDK 21
FROM gradle:8.11.1-jdk21
#Создаёт директорию job4j_devops внутри контейнера
RUN mkdir job4j_devops
#Устанавливает рабочую директорию для последующих команд.
WORKDIR /job4j_devops
#Копирует содержимое текущей директории(все файлы) внутрь контейнера
COPY . .
#Запускает сборку проекта с помощью Gradle, пропуская тесты (-x test).
RUN gradle clean build -x test
#Декларирует использование порта 8080 контейнером.
EXPOSE 8080
#Указывает команду для запуска приложения (исполнение JAR-файла).
ENTRYPOINT ["java", "-jar", "build/libs/DevOps-1.0.0.jar"]
